:PROPERTIES:
:ID:       01053c54-3772-4001-92bb-e219c9d7c6c7
:END:
#+HUGO_BASE_DIR: ~/code/justin.vc/
                     #+HUGO_SECTION: ./posts
                     #+HUGO_AUTO_SET_LASTMOD: t
#+macro: sidenote @@html:{{% sidenote "$1" $2 %}} $3 {{% /sidenote %}}@@
                     #+TITLE: Literate Kedro: Using Org-mode for Data Science
                     #+DATE: [2022-07-25 Mon 01:43]
                     #+HUGO_TAGS: org kedro python data-science emacs
                     #+HUGO_DRAFT: false
#+BIND: org-export-use-babel nil

****  Shell / Other

If you plan on using the terminal for all shell commands, this isn't necessary.
You can simply activate your conda environment with ~conda-env-activate~ under the
assumption you're using =conda.el=. Because the session is set at the top level,
it should persist through the following commands. See the echo commands below confirming.

#+begin_src bash :output silent
conda activate kedro-example
#+end_src

Making sure I'm in the correct directory / using the correct environment.
#+begin_src bash
echo $(pwd)
echo $(which pip)
#+end_src

#+RESULTS[3fb020328b37f48a4c8f291d519988026fc1fe36]:
| /home/justin/code/literate-kedro                  |
| /home/justin/anaconda3/envs/kedro-example/bin/pip |

